const distance = 'Расстояние по приборам:'
const ru = {
  listLanguage: [
    { shortName: 'en', text: 'АНГЛИЙСКИЙ' },
    { shortName: 'ua', text: 'УКРАИНСКИЙ' },
    { shortName: 'ru', text: 'РУССКИЙ' }
  ],
  startPage: {
    h1: 'Добро пожаловать в 3D мир будущего!',
    buttons: { language: 'ЯЗЫКИ', start: 'НАЧАТЬ ИГРАТЬ' },
    aboutGame:
      'Если вы видите эту страницу, возможно, соединение с сервером было потеряно в течение некоторого времени. Возможно, вы здесь впервые? В любом случае меню интуитивно понятное, а игровой процесс увлекательный. Это RPG, где вы обязательно встретите новых товарищей!'
  },
  loginPage: {
    h1: 'Пожалуйста сначало войдите',
    ask: 'У вас нет логина?',
    buttons: { registration: 'Зарегистрироваться', submit: 'ОТПРАВИТЬ' }
  },
  registerPage: {
    h1: 'Зарегистрируйтесь, пожалуйста',
    h2: 'Лицензия для игроков',
    textLicensia:
      'Разработчики могут полностью контролировать эту игру и апгредить что угодно. Не стоит рассчитывать, что игра всегда будет соответствовать вашим желаниям. Подписав настоящее соглашение, вы имеете право погрузиться в игровой мир в рамках замысла разработчика и не ущемляя при этом тех же прав других пользователей игры. За нарушение правил игры, установленных разработчиком, любой игрок может быть привлечен к ответственности как внутриигровой, так и по закону. Игрок может быть как временно заблокирован, так и удален с сервера без возможности восстановления. Все внутриигровые покупки считаются оплатой вашего досуга и возврату не подлежат. Приятной игры!',
    ask: 'Уже есть аккаунт?',
    agree: 'Я прочитал и согласен',
    buttons: {
      registration: 'Войти',
      submit: 'ОТПРАВИТЬ'
    }
  },
  setLordPage: {
    h1: 'Настройте вашего персонажа',
    ask: 'Придумайте имя своему персонажу',
    buttons: {
      desert: 'ПУСТЫНЯ',
      winter: 'ЗИМА'
    },
    history:
      'К 4800-му году человечество научилось использовать кротовые норы для перемещений по галактике, но как далеко бы не шел прогресс внутриние межусобицы и борьба за власть и ресурсы только усиливались, что в конце концов привело к полному расколу правления на две крупнейшие фракции, которые заняли критически важные для технологий источники ресурсов. Какую бы рассу ты не выбрал ты защищаешь мирных граждан от специальных военных операций по истощению вашей земли! Не допусти дисбаланс во вселенной!'
  },
  objects: {
    cristals: { title: 'Коробка', shortInfo: '', moreInfo: '', distance },
    car: { title: 'Car', shortInfo: '', moreInfo: '', distance },
    box: {
      title: 'Коробка',
      shortInfo: '',
      moreInfo: '',
      distance
    },
    portal: {
      title: 'Портал',
      shortInfo:
        'Врата построенные неизвестной цивилизацией позволяют путешествовать по вселенной',
      moreInfo:
        'Врата открывают портал в далеком космосе, тебе доступны путешествия в системы богатые ресурсами и аномалиями для исследования новых технологий но будь осторожен другая фракция хочет присвоить космос себе',
      distance
    },
    star: { title: 'Звезда', shortInfo: '', moreInfo: '', distance },
    hero: { title: 'Герой', shortInfo: '', moreInfo: '', distance }
  }
}
module.exports = { ru }
