const distance = 'Відстань до приладів: '
const ua = {
  listLanguage: [
    { shortName: 'en', text: 'АНГЛИЙСЬКА' },
    { shortName: 'ua', text: 'УКРАИНСКА' },
    { shortName: 'ru', text: 'РОСИЙСКА' }
  ],
  startPage: {
    h1: 'Ласкаво просимо у 3D світ майбутнього!',
    buttons: { language: 'МОВИ', start: 'РОЗПОЧАТИ ГРУ' },
    aboutGame:
      "Якщо ви бачите цю сторінку, можливо, зв’язок із сервером було втрачено на деякий час. Можливо, ви тут вперше? У будь-якому випадку меню інтуїтивно зрозуміле, а процес гри захоплюючий. Це RPG, де ви обов'язково зустрінете нових товаришів!"
  },
  loginPage: {
    h1: 'Увійдіть, будь ласка',
    ask: 'У вас немає логіна?',
    buttons: { registration: 'Зареєструватися', submit: 'ВІДПРАВИТИ' }
  },
  registerPage: {
    h1: 'Зареєструйтесь, будь ласка',
    h2: 'Ліцензія для гравців',
    textLicensia:
      'Розробники можуть повністю контролювати цю гру та вдосконалювати будь-що. Не варто сподіватися, що гра завжди буде відповідати вашим бажанням. Підписуючи цю угоду, ви маєте право занурюватися в ігровий світ в рамках задуму розробника і не порушуючи таких же прав інших користувачів гри. За порушення правил гри, встановлених розробником, будь-який гравець може бути притягнутий до відповідальності як внутрішньоігрової, так і юридичної. Гравця можна як тимчасово заблокувати, так і видалити з сервера без можливості відновлення. Усі покупки в грі вважаються оплатою вашого дозвілля і не підлягають відшкодуванню. Гарної гри!',

    ask: 'Вже є обліковий запис?',
    agree: 'Я прочитав і погоджуюся',
    buttons: {
      registration: 'Увийти',
      submit: 'ВІДПРАВИТИ'
    }
  },
  setLordPage: {
    h1: 'Налаштування вашого персонажа',
    ask: "Придумайте ім'я свого персонажа",
    buttons: {
      desert: 'ПУСТЕЛЯ',
      winter: 'ЗИМА'
    },
    history:
      'До 4800-му році человечество навчилося використовувати кротові нори для переміщення по галактиці, але як далеко не йшов прогрес внутрішньої межусобиці і боротьба за владу і ресурси тільки посилювалися, що в кінці кінців привело до повного розколу правління на дві найбільші фракції, які критично заняли. важные для технологий джерела ресурсів. Яку б розсу ти не вибрав, ти захищаєш мирних громадян від спеціальних військових операцій по істощенню вашої землі! Не допусти дисбаланс во вселенной!'
  },
  objects: {
    cristals: { title: 'Коробка', shortInfo: '', moreInfo: '', distance },
    car: { title: 'Авто', shortInfo: '', moreInfo: '', distance },
    box: {
      title: 'Коробка',
      shortInfo: 'порожня коробка',
      moreInfo: '',
      distance
    },
    portal: {
      title: 'Брама',
      shortInfo:
        'Брама дозволяють подорожувати всесвітом для стрибка вам необхідно знаходитися біля воріт',
      moreInfo: '',
      distance
    },
    star: { title: 'зірка', shortInfo: '', moreInfo: '', distance },
    hero: { title: 'Hero', shortInfo: '', moreInfo: '', distance }
  }
}
module.exports = { ua }
